tutorials/Exreme_none/background/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "$FOAM_CASE/0/include/boundaryConditions"

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(outlet|atmosphere)"
    {
        type            calculated;
        value           $internalField;
    }

    
    "(bottom|floater)"
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;
    }
    
     "(oversetPatch|sides)"
     {
         patchType       overset;
         type            overset;
    }

   "(inlet)"
    {
          type            calculated;
          value           $internalField;
          //#include       "$FOAM_CASE/0/include/nutinlet"
    }


    walls
    {
          //type    empty;
          type            nutkWallFunction;
          Cmu             0.09;
          kappa           0.41;
          E               9.8;
          value           $internalField;
    } 

}


// ************************************************************************* //
